hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/afsk.c
// Over-range reporting. s_clipWarn is the operator's selection; s_clipNextWarnMs
// is the millisecond timestamp before which no further warning is emitted, kept
// as a deadline rather than a countdown so the comparison stays correct across
// the 32-bit wrap.
static bool s_clipWarn = false;
static uint32_t s_clipNextWarnMs = 0;

// Raw conversion results this close to either end of the 12-bit range are taken
// as over-range: the last few codes are already outside the converter's usable
// window, and on an interface without input clamp diodes reaching them also
// means the pin is being driven past the supply rails.
#define CLIP_RAW_LOW      15
#define CLIP_RAW_HIGH     4080
#define CLIP_WARN_HOLD_MS 5000

// DAC sample rate the modulator is programmed for. Fixed while the modem runs:
// AFSK_init() turns it into the sample-clock alarm period and ModemInit() turns
// it into the tone phase steps and the baud-rate divider, so it is only writable
// while the hardware is stopped.
static uint32_t s_dacRate = MODEM_DAC_SAMPLERATE;

// Selection state of the ADC pad's internal input bias.
static bool s_adcSelfBias = false;

// Running DC average of the raw ADC stream, used to re-centre the samples
// before demodulation.
#define AVG_N 125
static uint16_t s_avgBuf[AVG_N];
static uint8_t s_avgIdx = 0;
static int s_avgSum = 0;
static uint16_t s_avg = 2048;

// DAC idle/centre code and amplitude scaling.
//
// IRAM_ATTR: called directly from dac_timer_isr(), which is itself IRAM_ATTR.
// A plain "static inline" is only a hint - at CONFIG_COMPILER_OPTIMIZATION_DEBUG
// (-Og), GCC frequently declines it, and an un-inlined static function is
// placed in flash by default. That introduces the exact XIP-fetch jitter the
// other ISR-path functions on the transmit side (dac_write_isr() here,
// calculateCRC() in ax25.c) are IRAM_ATTR to avoid.
#define DAC_MID 128

// Peak-to-peak swing of the DAC output, in percent of the full range. Written
// only by afskSetDacAmplitude() (task context) and read by dac_scale() in the
// DAC timer ISR: a single-byte load, so the ISR either sees the old value or
// the new one and never a torn intermediate. A change therefore takes effect
// on the next sample, without stopping the modulator.
static uint8_t s_dacAmplitudePct = MODEM_DAC_AMPLITUDE_PCT;

static inline uint8_t IRAM_ATTR dac_scale(uint8_t s) {
    int v = DAC_MID + (((int)s - DAC_MID) * (int)s_dacAmplitudePct) / 100;
    if (v < 0)
        v = 0;
    if (v > 255)
        v = 255;
    return (uint8_t)v;
}

// ------------------------------------------------------------------
// Receive front end: gate, gain control, high-pass, resampler
// ------------------------------------------------------------------

#define AGC_TARGET_RMS 0.2f // target RMS level (-10 dBFS)

// Attack = gain coming DOWN because the signal is too loud. It must be fast:
// an overdriven demodulator input is clamped to +-2047 and hard-limited.
// With AGC_MAX_STEP bounding the error to 0.5 per block, 0.25 lowers the gain
// by an eighth per 20 ms block, halving it in about 100 ms. Release = gain
// going UP on a quiet signal, and must be slow so noise between frames does
// not pump the gain.
#define AGC_ATTACK   0.25f
#define AGC_RELEASE  0.002f
#define AGC_MAX_GAIN 8.0f
#define AGC_MIN_GAIN 0.1f

// Below this in-band RMS there is nothing but converter noise, so there is no
// meaningful level to track.
#define AGC_SQUELCH_RMS 0.01f

// Most the gain may change in a single 20 ms block. Without this a single
// near-silent block drives error towards infinity and slams the gain to the
// rail in one step.
#define AGC_MAX_STEP 2.0f

// Receive gate. s_gateOnMv is the opening threshold (0 = no gate), the gate
// closes below half of it; s_dcdCnt counts blocks above the threshold. The
// pending values are written by afskSetRxFrontEnd() and copied into the live
// ones by afskSetModem() while the receive task is held.
static uint16_t s_gateOnMv = 10;
static uint16_t s_gateOffMv = 5;
static uint16_t s_pendGateMv = 10;

// Receive gain: automatic, or fixed at s_fixedGain.
static bool s_agcFixed = false;
static float s_fixedGain = 1.0f;
static bool s_pendAgcFixed = false;
static int8_t s_pendFixedGainDb = 0;

// Second-order Butterworth high-pass on the decimated AFSK signal, direct
// form I, disabled while s_hpfOn is false.
static uint16_t s_pendHpfHz = 0;
static bool s_hpfOn = false;
static float s_hpfB0, s_hpfB1, s_hpfB2, s_hpfA1, s_hpfA2;
static float s_hpfX1, s_hpfX2, s_hpfY1, s_hpfY2;

// Decimated blocks received while the gate was closed, oldest first once the
// ring has wrapped. When the gate opens these are demodulated ahead of the
// block that opened it, so the start of a transmission - the blocks that
// were needed to decide the gate should open - still reaches the
// demodulators. RX_HOLD_BLOCKS matches the number of blocks the gate needs.
#define RX_HOLD_BLOCKS   3
#define RX_DECIM_SAMPLES (MODEM_BLOCK_SIZE / MODEM_RESAMPLE_RATIO)
static float s_hold[RX_HOLD_BLOCKS][RX_DECIM_SAMPLES];
static uint8_t s_holdHead = 0;  // slot the next closed block is written to
static uint8_t s_holdCount = 0; // valid slots

// @brief Track the input level on the block about to be demodulated.
//
// Measures the in-band (decimated, for the AFSK profiles) signal rather than
// the raw ADC stream, so out-of-band noise - the bulk of a discriminator
// output's energy above 5 kHz - does not set the gain. Only called while the
// gate is open. A near-silent block holds the gain where it is: adapting on
// it would compute AGC_TARGET_RMS/~0, peg the gain at AGC_MAX_GAIN and hand
// the next transmission to the demodulators overdriven.
static void update_agc(const float *buf, size_t len) {
    float sum_sq = 0;
    for (size_t i = 0; i < len; i++)
        sum_sq += buf[i] * buf[i];

    float level = sqrtf(sum_sq / (float)len) * s_agcGain;
    if (level < AGC_SQUELCH_RMS)
        return;

    float error = AGC_TARGET_RMS / level;
    if (error > AGC_MAX_STEP)
        error = AGC_MAX_STEP;
    else if (error < 1.0f / AGC_MAX_STEP)
        error = 1.0f / AGC_MAX_STEP;

    float rate = (error < 1.0f) ? AGC_ATTACK : AGC_RELEASE;

    s_agcGain += (s_agcGain * error - s_agcGain) * rate;
    s_agcGain = fmaxf(fminf(s_agcGain, AGC_MAX_GAIN), AGC_MIN_GAIN);
}

