hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/afsk.c
// @brief Build the high-pass coefficients for a corner at hz, or disable it.
static void hpf_setup(uint16_t hz) {
    s_hpfX1 = s_hpfX2 = s_hpfY1 = s_hpfY2 = 0.0f;
    s_hpfOn = (hz > 0);
    if (!s_hpfOn)
        return;

    // Bilinear transform of a second-order Butterworth high-pass.
    const float k = tanf((float)M_PI * (float)hz / (float)MODEM_DEMOD_SAMPLERATE);
    const float q = 1.41421356f; // 1 / Q, Q = 1/sqrt(2)
    const float norm = 1.0f / (1.0f + q * k + k * k);
    s_hpfB0 = norm;
    s_hpfB1 = -2.0f * norm;
    s_hpfB2 = norm;
    s_hpfA1 = 2.0f * (k * k - 1.0f) * norm;
    s_hpfA2 = (1.0f - q * k + k * k) * norm;
}

static void hpf_run(float *buf, int len) {
    for (int i = 0; i < len; i++) {
        float x = buf[i];
        float y = s_hpfB0 * x + s_hpfB1 * s_hpfX1 + s_hpfB2 * s_hpfX2 - s_hpfA1 * s_hpfY1 - s_hpfA2 * s_hpfY2;
        s_hpfX2 = s_hpfX1;
        s_hpfX1 = x;
        s_hpfY2 = s_hpfY1;
        s_hpfY1 = y;
        buf[i] = y;
    }
}

// @brief Hand one block to the demodulators at the current gain.
//
// demodulate() is documented for <= 13 bit input, and filterRun() accumulates
// coeff*sample in an int32 across up to MODEM_RX_BPF_TAPS_MAX taps. Clamping
// here keeps both safe no matter what the gain or a hot input does.
static void demod_feed(const float *buf, int len) {
    const float scale = s_agcGain * 2048.0f;

    for (int i = 0; i < len; i++) {
        float v = buf[i] * scale;
        if (v > 2047.0f)
            v = 2047.0f;
        else if (v < -2047.0f)
            v = -2047.0f;
        MODEM_DECODE((int16_t)v, (uint16_t)s_mVrms);
    }
}

// @brief Keep a decimated block received while the gate was closed.
static void hold_push(const float *buf, int len) {
    memcpy(s_hold[s_holdHead], buf, (size_t)len * sizeof(float));
    s_holdHead = (uint8_t)((s_holdHead + 1) % RX_HOLD_BLOCKS);
    if (s_holdCount < RX_HOLD_BLOCKS)
        s_holdCount++;
}

// @brief Demodulate the held blocks, oldest first, and empty the ring.
static void hold_flush(int len) {
    uint8_t slot = (uint8_t)((s_holdHead + RX_HOLD_BLOCKS - s_holdCount) % RX_HOLD_BLOCKS);

    for (uint8_t n = 0; n < s_holdCount; n++) {
        demod_feed(s_hold[slot], len);
        slot = (uint8_t)((slot + 1) % RX_HOLD_BLOCKS);
    }
    s_holdCount = 0;
}

// Anti-alias FIR for the MODEM_ADC_SAMPLERATE -> 9600 Hz decimation.
//
// The cutoff is fixed by the job: 4800 Hz, the 9600 Hz Nyquist. The LENGTH is
// not - it is set by the ratio, because the cutoff is what matters in NORMALISED
// terms and that halves when the input rate doubles. The 8-tap set below was cut
// for 38400 -> 9600 (4:1, normalised cutoff 0.125). Reusing it at 76800 -> 9600
// (8:1, normalised 0.0625) does not filter, it just picks every eighth output of
// a filter that is now twice too wide, and the AFSK profiles alias into
// unintelligibility - verified on the host, 48 % BER.
//
// So the taps follow the ratio. Both sets are Hamming-windowed sincs at 4800 Hz
// and both are host-verified to give 0 bit errors on Bell202, V.23 and AFSK300.
#if MODEM_RESAMPLE_RATIO == 8
#define FILTER_TAPS 16
static const float resample_coeffs[FILTER_TAPS] = {
    0.000813f, 0.004002f, 0.013722f, 0.033895f, 0.064417f, 0.100105f, 0.132060f, 0.150986f,
    0.150986f, 0.132060f, 0.100105f, 0.064417f, 0.033895f, 0.013722f, 0.004002f, 0.000813f,
};
#elif MODEM_RESAMPLE_RATIO == 4
#define FILTER_TAPS 8
static const float resample_coeffs[FILTER_TAPS] = {
    0.003560f, 0.038084f, 0.161032f, 0.297324f, 0.297324f, 0.161032f, 0.038084f, 0.003560f,
};
#elif MODEM_RESAMPLE_RATIO == 1
#define FILTER_TAPS 1
static const float resample_coeffs[FILTER_TAPS] = { 1.0f };
#else
#error "No decimation FIR for this MODEM_RESAMPLE_RATIO. Cut one at 4800 Hz for the new ratio; do not reuse a filter designed for a different one."
#endif

#if FILTER_TAPS > 1
// The last FILTER_TAPS - 1 raw samples of the previous block, prepended
// ahead of this one so the filter has real data to draw on instead of
// zeros at the join. A decimator fed block-by-block must carry this
// history between calls.
static float s_resampleTail[FILTER_TAPS - 1];
#endif

// The decimator filters buf[] into the front of buf[] itself: output i lands in
// buf[i] while the taps read the window that ends at buf[i *
// MODEM_RESAMPLE_RATIO]. Almost none of that overlaps, and the proof is worth
// spelling out because it is what keeps a whole block out of .bss.
//
// The samples output i reads from buf[] sit at indices
// [i * MODEM_RESAMPLE_RATIO - (FILTER_TAPS - 1) .. i * MODEM_RESAMPLE_RATIO].
// Take one such index r with r >= FILTER_TAPS - 1 and suppose the loop had
// already overwritten it, that is r < i. The lower bound with
// MODEM_RESAMPLE_RATIO >= 2 gives r >= 2i - (FILTER_TAPS - 1), and r < i gives
// 2i > 2r, so r > 2r - (FILTER_TAPS - 1), i.e. r < FILTER_TAPS - 1 - which
// contradicts the assumption. So every read that CAN land on an already-written
// slot lies below index FILTER_TAPS - 1, and there are at most FILTER_TAPS - 1
// of them: at ratio 8 they are the reads of buf[0] and buf[1] taken while
// computing outputs 1 and 2.
//
// The filter therefore needs two short runs of history and no full-block copy:
// the previous block's tail (s_resampleTail) and this block's own leading
// FILTER_TAPS - 1 samples. They are staged together in hist[] so that the tap
// index k walks the conceptual [ previous tail ][ this block ] sequence with a
// single bound test; everything from index FILTER_TAPS - 1 upwards is read
// straight out of buf[], still raw.
_Static_assert(MODEM_RESAMPLE_RATIO >= 2 || FILTER_TAPS == 1,
               "In-place decimation needs MODEM_RESAMPLE_RATIO >= 2: at ratio 1 a multi-tap filter reads its own output.");
_Static_assert(MODEM_BLOCK_SIZE >= 2 * (FILTER_TAPS - 1), "MODEM_BLOCK_SIZE must hold the leading and trailing history runs without them overlapping.");

static void resample_audio(float *buf) {
#if FILTER_TAPS > 1
    // [ previous block's tail ][ this block's first FILTER_TAPS - 1 samples ]
    float hist[2 * (FILTER_TAPS - 1)];
    memcpy(hist, s_resampleTail, sizeof(s_resampleTail));
    memcpy(hist + (FILTER_TAPS - 1), buf, (FILTER_TAPS - 1) * sizeof(float));

    // Take this block's own tail now, before the decimation loop runs. The
    // loop only ever writes the first MODEM_BLOCK_SIZE / MODEM_RESAMPLE_RATIO
    // slots and so cannot reach these, but reading them up front means the
    // tail no longer depends on where the write pointer stops.
    for (int t = 0; t < FILTER_TAPS - 1; t++)
        s_resampleTail[t] = buf[MODEM_BLOCK_SIZE - (FILTER_TAPS - 1) + t];
#endif

    for (int i = 0; i < MODEM_BLOCK_SIZE / MODEM_RESAMPLE_RATIO; i++) {
        float sum = 0;
        for (int j = 0; j < FILTER_TAPS; j++) {
#if FILTER_TAPS > 1
            // k indexes the conceptual [ tail ][ block ] sequence; hist[] holds
            // its first 2 * (FILTER_TAPS - 1) entries.
            int k = i * MODEM_RESAMPLE_RATIO + j;
            float in = (k < 2 * (FILTER_TAPS - 1)) ? hist[k] : buf[k - (FILTER_TAPS - 1)];
#else
            float in = buf[i * MODEM_RESAMPLE_RATIO + j]; // MODEM_RESAMPLE_RATIO == 1, reads and writes the same slot
#endif
            sum += in * resample_coeffs[j];
        }
        buf[i] = sum;
    }
}

// ------------------------------------------------------------------
// LEDs / PTT
// ------------------------------------------------------------------

static uint8_t r_old = 0, g_old = 0, b_old = 0;
static int64_t rgbTimeout = 0;

// PTT pin is a fixed compile-time constant (::MODEM_PTT_GPIO, an internal
// radiomodem feature - like ::MODEM_ADC_GPIO / ::MODEM_DAC_GPIO it is not
// runtime/web-admin selectable). Its active level is likewise fixed at
// compile time (::MODEM_PTT_ACTIVE_HIGH) and is not a user-facing polarity
// toggle - AFSK_setPttActiveHigh() is only ever called with that same
// compile-time value, from modem_init()/modem_set_modem(), including once
// live per Radio-page Save (aprs_service_apply_modem_config()) as part of
// re-applying the whole modem config.
//
// s_pttActiveHigh is read from setPtt(), which runs from the DAC timer ISR
// (IRAM_ATTR, fires continuously during TX) - so any change to it from task
// context must be made atomic with respect to that ISR. s_pttMux guards
// exactly that variable; it must never be held around gpio_set_level(), which
// is not guaranteed ISR-safe on this target.
static const int8_t s_pttGpio = MODEM_PTT_GPIO;
static bool s_pttActiveHigh = MODEM_PTT_ACTIVE_HIGH ? true : false;
static portMUX_TYPE s_pttMux = portMUX_INITIALIZER_UNLOCKED;

bool afsk_gpio_is_output_capable(int8_t gpio) {
    if (gpio == -1)
        return true; // "disabled" is always accepted
    if (gpio < 0 || gpio > 39)
        return false;
    if (gpio >= 34 && gpio <= 39)
        return false; // input-only, cannot drive an output
    if (gpio >= 6 && gpio <= 11)
        return false; // internal SPI flash/PSRAM, not brought out
    return true;
}

bool afsk_ptt_gpio_is_valid(int8_t gpio) {
    if (gpio == -1)
        return true; // "disabled" is always accepted
    if (!afsk_gpio_is_output_capable(gpio))
        return false;
    if (gpio == MODEM_ADC_GPIO || gpio == MODEM_DAC_GPIO)
        return false; // already used by the audio front end
    return true;
}

