hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/afsk.c
    // s_pttGpio is the fixed ::MODEM_PTT_GPIO compile-time constant.
    //
    // GPIO_MODE_INPUT_OUTPUT, not GPIO_MODE_OUTPUT: on ESP32 the input path
    // (pad input buffer / FUN_IE) is a separate enable from the output
    // driver, and gpio_config(GPIO_MODE_OUTPUT) does not turn it on. With
    // only GPIO_MODE_OUTPUT the pad reads back as 0 no matter what level is
    // actually being driven, so the keying line cannot be observed on-chip at
    // all. INPUT_OUTPUT keeps the pin driven by setPtt() while leaving the
    // real pad voltage readable, which is what makes a keying fault
    // diagnosable from a debugger without a scope on the PTT line.
    if (s_pttGpio >= 0) {
        gpio_config_t pttCfg = {
            .pin_bit_mask = 1ULL << s_pttGpio,
            .mode = GPIO_MODE_INPUT_OUTPUT,
        };

        // The idle level is published before the pad becomes an output. The
        // output register resets to 0, which is the ACTIVE level for an
        // active-low PTT, so a pad that takes its direction first drives the
        // keying line active for the length of the configuration call - and
        // modem_init() goes on to spend about five seconds measuring the ADC
        // clock right after this. Writing the level first sends the pad
        // straight to idle; the write after gpio_config() is what puts it
        // there when the output register was not the path taken.
        gpio_set_level((gpio_num_t)s_pttGpio, s_pttActiveHigh ? 0 : 1);
        gpio_config(&pttCfg);
        gpio_set_level((gpio_num_t)s_pttGpio, s_pttActiveHigh ? 0 : 1);
    }
#if MODEM_LED_TX_GPIO >= 0
    gpio_config_t ledTxCfg = { .pin_bit_mask = 1ULL << MODEM_LED_TX_GPIO, .mode = GPIO_MODE_OUTPUT };
    gpio_config(&ledTxCfg);
#endif
#if MODEM_LED_RX_GPIO >= 0
    gpio_config_t ledRxCfg = { .pin_bit_mask = 1ULL << MODEM_LED_RX_GPIO, .mode = GPIO_MODE_OUTPUT };
    gpio_config(&ledRxCfg);
#endif

    // ---- DAC ----
    dac_oneshot_config_t dacCfg = { .chan_id = MODEM_DAC_CHANNEL };
    err = dac_oneshot_new_channel(&dacCfg, &s_dac);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "dac_oneshot_new_channel: %s", esp_err_to_name(err));
        return err;
    }
    dac_oneshot_output_voltage(s_dac, DAC_MID);
    ESP_LOGI(TAG, "DAC on GPIO%d (channel %d)", MODEM_DAC_GPIO, (int)MODEM_DAC_CHANNEL);

    // ---- ADC ----
    // Pinned: adc_continuous_new_handle() allocates the DMA interrupt, and
    // esp_intr_alloc() binds it to the calling core. This is the core whose
    // level 3 gets masked across every conversion-frame memcpy, so it must be
    // a core the modulator is not on.
    err = run_on_core(MODEM_ADC_ISR_CORE, adc_start_continuous);
    if (err != ESP_OK)
        return err;

    // After the continuous driver, never before it: bringing the ADC up puts
    // the pad in analog mode and disconnects both of its pull resistors, so the
    // selection is applied once the driver is done with the pin. Nothing else
    // reconfigures the pad afterwards - afskSetModem() only rebuilds the
    // demodulator and AX.25 state - so this holds until AFSK_deinit().
    if (s_adcSelfBias)
        afskSetAdcSelfBias(true);

    // ---- DAC sample clock ----
    // Pinned to the other core. See dac_timer_create().
    err = run_on_core(MODEM_DAC_TIMER_CORE, dac_timer_create);
    if (err != ESP_OK)
        return err;

    // ---- DSP task ----
    BaseType_t ok;
    s_rxStop = false;
    s_rxExited = false;
#if MODEM_RX_TASK_CORE >= 0
    ok = xTaskCreatePinnedToCore(afsk_rx_task, "afsk_rx", MODEM_RX_TASK_STACK, NULL, MODEM_RX_TASK_PRIO, &s_rxTask, MODEM_RX_TASK_CORE);
#else
    ok = xTaskCreate(afsk_rx_task, "afsk_rx", MODEM_RX_TASK_STACK, NULL, MODEM_RX_TASK_PRIO, &s_rxTask);
#endif
    if (ok != pdPASS) {
        ESP_LOGE(TAG, "cannot create the RX task");
        return ESP_ERR_NO_MEM;
    }

    setTransmit(false);
    s_txStopPending = false;
    s_inited = true;
    ESP_LOGI(TAG, "AFSK hardware ready (%s duplex)", s_fullDuplex ? "full" : "half");
    return ESP_OK;
}

void AFSK_deinit(void) {
    if (!s_inited)
        return;

    if (s_rxTask) {
        TaskHandle_t rx = s_rxTask;

        // Resume first: afskSetModem() may have left it suspended, and a
        // suspended task will never see s_rxStop.
        vTaskResume(rx);
        s_rxStop = true;
        for (int i = 0; (i < 40) && !s_rxExited; i++) // the read timeout is 100 ms
            vTaskDelay(pdMS_TO_TICKS(10));
        if (!s_rxExited) {
            ESP_LOGW(TAG, "RX task did not exit in 400 ms, deleting it");
            vTaskDelete(rx);
        }
        s_rxTask = NULL;
    }
    if (s_adc) {
        adc_continuous_stop(s_adc);
        adc_continuous_deinit(s_adc);
        s_adc = NULL;
    }
    if (s_cali) {
        adc_cali_delete_scheme_line_fitting(s_cali);
        s_cali = NULL;
    }
    if (s_dacTimer) {
        // No core juggling needed on the way out, unlike AFSK_init(): the
        // timer's interrupt lives on MODEM_DAC_TIMER_CORE, but esp_intr_free()
        // (reached via gptimer_del_timer) detects a cross-core call and IPCs
        // itself over, and esp_intr_disable() for a peripheral source goes
        // through the interrupt matrix, which either core may write.
        if (s_dacTimerRunning) {
            gptimer_stop(s_dacTimer);
            s_dacTimerRunning = false;
        }
        gptimer_disable(s_dacTimer);
        gptimer_del_timer(s_dacTimer);
        s_dacTimer = NULL;
    }
    if (s_dac) {
        dac_oneshot_del_channel(s_dac);
        s_dac = NULL;
    }
    s_inited = false;
    ESP_LOGI(TAG, "AFSK hardware released");
}
